# Pandas Basics

In [2]:
import pandas as pd
import numpy as np

In [1]:
# convert tuple to series
s = ("good", 11, 56.5, "excellent")
s

('good', 11, 56.5, 'excellent')

In [3]:
h = pd.Series(s)
type(h)

pandas.core.series.Series

In [4]:
print(h)

0         good
1           11
2         56.5
3    excellent
dtype: object

In [5]:
# Convert dictionary to series
d = {"name": "amy", "age": 25, "sex": "female"}
d

{'name': 'amy', 'age': 25, 'sex': 'female'}

In [6]:
pd.Series(d)

name       amy
age         25
sex     female
dtype: object

In [7]:
# convert list to series
l = [11, 34, "amy", 45.22]

In [8]:
pd.Series(l)

0       11
1       34
2      amy
3    45.22
dtype: object

In [11]:
f = pd.Series(l, index = ['index', 'age', 'name', 'sal'])

In [12]:
f

index       11
age         34
name       amy
sal      45.22
dtype: object

In [14]:
f[3]

45.22

In [15]:
f['index']

11

In [16]:
f[['age', 'name']]

age      34
name    amy
dtype: object

In [17]:
# Convert dictionary to dataframe
d = {'name': ['amy', 'beth', 'cathy', 'deb'],
    "age": [34,22,26,17],
    'sex': ['F', 'F', 'F', 'M']}

In [18]:
d

{'name': ['amy', 'beth', 'cathy', 'deb'],
 'age': [34, 22, 26, 17],
 'sex': ['F', 'F', 'F', 'M']}

In [21]:
df = pd.DataFrame(d)

In [22]:
df

    name  age sex
0    amy   34   F
1   beth   22   F
2  cathy   26   F
3    deb   17   M

In [23]:
df['owner'] = 'owner'
df

    name  age sex  owner
0    amy   34   F  owner
1   beth   22   F  owner
2  cathy   26   F  owner
3    deb   17   M  owner

In [26]:
df['new_col'] = [12,56,22,33]
df

    name  age sex  owner  new_col
0    amy   34   F  owner       12
1   beth   22   F  owner       56
2  cathy   26   F  owner       22
3    deb   17   M  owner       33

In [27]:
df.index = ['one', 'two', 'three', 'four']

In [28]:
df

        name  age sex  owner  new_col
one      amy   34   F  owner       12
two     beth   22   F  owner       56
three  cathy   26   F  owner       22
four     deb   17   M  owner       33

In [30]:
df.set_index(['name'], inplace = True)

In [31]:
df

       age sex  owner  new_col
name
amy     34   F  owner       12
beth    22   F  owner       56
cathy   26   F  owner       22
deb     17   M  owner       33

In [32]:
df['age']

name
amy      34
beth     22
cathy    26
deb      17
Name: age, dtype: int64

In [35]:
df.age.iloc[2]

26

In [38]:
df.iloc[1,3]

56

In [41]:
df.loc['amy']

age           34
sex            F
owner      owner
new_col       12
Name: amy, dtype: object

In [43]:
df.age

name
amy      34
beth     22
cathy    26
deb      17
Name: age, dtype: int64

In [45]:
df.age.iloc[3]

17

In [47]:
del df['owner']

In [48]:
df

       age sex  new_col
name
amy     34   F       12
beth    22   F       56
cathy   26   F       22
deb     17   M       33

In [50]:
df.drop(['new_col', 'sex'], axis = 1, inplace = True)

In [51]:
df

       age
name
amy     34
beth    22
cathy   26
deb     17